import css from './LocationDescription.module.css';

interface LocationDescriptionProps {
  description: string;
}

export default function LocationDescription({
  description = '"Бакотська затока — це справжня перлина Поділля, яку часто називають "українською Атлантидою". Розташована на річці Дністер, вона вражає своїми масштабами та неймовірними панорамними краєвидами, що відкриваються з високих скелястих берегів. Це місце з унікальною енергетикою, де поєднуються тиша, велич природи та багата історія затопленого села Бакота. Тут можна насолодитися неспішними прогулянками вздовж берега, влаштувати пікнік з видом на затоку або вирушити на водну прогулянку на човні чи каяку. Завдяки унікальному мікроклімату, схожому на ялтинський, це місце ідеально підходить для відпочинку з наметами. Поруч знаходиться скельний монастир, що додає цій локації історичної та духовної цінності. Бакота — це ідеальний вибір для тих, хто шукає спокою, єднання з природою та незабутніх вражень."',
}: LocationDescriptionProps) {
  return <p className={css['location-story']}>{description}</p>;
}
